app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      @artist=Artist.find_or_create_by(name: song[1])
      @artist.songs.build(title: song[0])
      @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-01 03:34:14.971049"], ["updated_at", "2018-08-01 03:34:14.971049"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-01 03:35:18.621753"], ["updated_at", "2018-08-01 03:35:18.621753"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 137], ["updated_at", "2018-08-01 03:34:15.001357"], ["id", 187]]